{
  "abatacept": "No side effects information found on this page.",
  "acetaminophen": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.  It focuses on serious and potentially life-threatening side effects associated with overdose or interactions.\n\nSERIOUS SIDE EFFECTS:  Life-threatening breathing problems (slowed breathing, long pauses between breaths, shortness of breath), especially during the first 24-72 hours of treatment and when the dose is increased.  Death to others who accidentally ingest the medication. Increased risk of serious or life-threatening breathing problems, sedation, or coma when taken with certain medications or alcohol.  Life-threatening withdrawal symptoms in newborns whose mothers took the medication regularly during pregnancy.\n\nRARE SIDE EFFECTS: The provided text does not specify rare side effects.",
  "adalimumab": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.\n\nSERIOUS SIDE EFFECTS: Serious infections (potentially fatal),  worsening of existing tuberculosis or hepatitis B,  severe or life-threatening cancers (especially in children, teenagers, and young adults).  Symptoms of serious infections include weakness, sweating, sore throat, cough (with bloody mucus), fever, weight loss, extreme tiredness, diarrhea, stomach pain, warm/red/painful skin, painful/difficult/frequent urination. Symptoms of worsening TB include cough, weight loss, muscle loss, fever, night sweats. Symptoms of worsening hepatitis B include excessive tiredness, yellowing of skin/eyes, loss of appetite, nausea/vomiting, muscle aches, dark urine, clay-colored stools, fever, chills, stomach pain, rash. Cancer symptoms include stomach pain, fever, unexplained weight loss, swollen glands, easy bruising/bleeding.\n\nRARE SIDE EFFECTS: The provided text does not specify rare side effects.",
  "albuterol": "No side effects information found on this page.",
  "alfacalcidol": "No side effects information found.",
  "alirocumab": "COMMON SIDE EFFECTS: Redness, itching, swelling, pain, or tenderness at the injection site; flu-like symptoms, fever, headache, or chills.\n\nSERIOUS SIDE EFFECTS:  The provided text does not list specific serious side effects, only that \"Some side effects can be serious.\"  Further information would be needed to identify these.\n\nRARE SIDE EFFECTS: The provided text does not list rare side effects.",
  "alprazolam": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.\n\nSERIOUS SIDE EFFECTS:  Serious or life-threatening breathing problems, sedation, coma (especially when used with certain opiate medications).  Withdrawal symptoms (unusual movements, ringing in ears, anxiety, memory problems, difficulty concentrating, sleep problems, seizures, shaking, muscle twitching, changes in mental health, depression, burning or prickling feeling in extremities, hallucinations, thoughts of self-harm or harming others, overexcitement, loss of touch with reality) can occur if the medication is stopped suddenly.\n\nRARE SIDE EFFECTS: The provided text does not specify rare side effects.",
  "alteplase": "No side effects information found.",
  "amitriptyline": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.\n\nSERIOUS SIDE EFFECTS: Suicidal thoughts or behavior (especially in children, teenagers, and young adults), new or worsening depression, extreme worry, agitation, panic attacks, sleep disturbances, aggressive behavior, irritability, acting without thinking, severe restlessness, and frenzied abnormal excitement.\n\nRARE SIDE EFFECTS: The provided text does not list rare side effects.",
  "amlodipine": "COMMON SIDE EFFECTS: swelling of the hands, feet, ankles, or lower legs; nausea; stomach pain; dizziness or lightheadedness; drowsiness; excessive tiredness; flushing; muscle stiffness or tremors.\n\nSERIOUS SIDE EFFECTS: more frequent or more severe chest pain; rapid, pounding, or irregular heartbeat; fainting.\n\nRARE SIDE EFFECTS:  The provided text does not specify rare side effects.",
  "amoxicillin": "COMMON SIDE EFFECTS: nausea, vomiting, diarrhea, temporary tooth discoloration (yellow, brown, or gray).\n\nSERIOUS SIDE EFFECTS: rash, skin blisters or peeling, itching, hives, wheezing, difficulty swallowing or breathing, swelling of the face, throat, tongue, lips, and eyes, prolonged vomiting (1-4 hours after dose) with diarrhea, extreme tiredness, and paleness (within 24 hours of dose), severe diarrhea (watery or bloody stools) with or without fever and stomach cramps (may occur up to 2 months after treatment).\n\nRARE SIDE EFFECTS:  The provided text does not specify rare side effects beyond mentioning that other side effects are possible and to contact a doctor if any unusual problems occur.",
  "amphetamine": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.\n\nSERIOUS SIDE EFFECTS:  Fast, pounding, or irregular heartbeat; sweating; dilated pupils; abnormally excited mood; restlessness; irritability; difficulty falling asleep or staying asleep; hostility; aggression; anxiety; loss of appetite; loss of coordination; uncontrollable movement of a body part; flushed skin; vomiting; stomach pain; thoughts of harming or killing oneself or others; serious heart problems; sudden death; severe depression; extreme tiredness (upon sudden cessation after overuse).  Weight loss in children under 6 years of age (mentioned as a new safety concern requiring label revision).\n\nRARE SIDE EFFECTS: The provided text does not specify rare side effects.",
  "apixaban": "No side effects information found on this page.  While the page mentions serious risks associated with stopping the medication abruptly and interactions with other drugs, it does not list specific side effects of apixaban itself.",
  "aripiprazole": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.  It mentions that the doctor may adjust dosage based on side effects experienced, but doesn't specify what those are.\n\nSERIOUS SIDE EFFECTS: Increased chance of death and increased risk of stroke or ministroke in older adults with dementia.  Suicidal thoughts or actions, especially in children, teenagers, and young adults at the beginning of treatment or when the dose is changed.\n\nRARE SIDE EFFECTS: The provided text does not list rare side effects.",
  "aspirin": "No side effects information found on this page.  While the page mentions side effects as a section title, the content for that section is not included in the provided text.",
  "atomoxetine": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.\n\nSERIOUS SIDE EFFECTS: Suicidal thoughts or behavior (especially in children and adolescents), sudden and unusual changes in behavior (including increased agitation, irritability, aggression, or difficulty sleeping),  worsening depression.  The text strongly emphasizes close monitoring for these in children and adolescents.\n\nRARE SIDE EFFECTS: The provided text does not specify rare side effects.",
  "atorvastatin": "COMMON SIDE EFFECTS: diarrhea, heartburn, gas, joint pain, forgetfulness or memory loss, confusion\n\nSERIOUS SIDE EFFECTS:  The provided text mentions that some side effects can be serious but does not list specific examples requiring immediate medical attention.  It only states that if any symptoms are severe or do not go away, a doctor should be contacted.\n\nRARE SIDE EFFECTS:  No rare side effects are specifically listed.",
  "atropine": "COMMON SIDE EFFECTS: eye irritation and redness, swelling of the eyelids, sensitivity to bright light, dry mouth, red or dry skin, blurred vision.\n\nSERIOUS SIDE EFFECTS: fever, irritability, fast pulse, irregular heartbeat, mental confusion, difficulty urinating.\n\nRARE SIDE EFFECTS:  No rare side effects are specifically listed.",
  "azithromycin": "No side effects information found on this page.  While the page mentions a \"SIDE EFFECTS\" section, the provided text does not contain the content of that section.",
  "baricitinib": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.  It focuses heavily on serious potential side effects and warnings.\n\nSERIOUS SIDE EFFECTS:  Serious infections (including fungal, bacterial, or viral; potentially fatal), lymphoma and other cancers (including lung and skin cancer), serious heart problems (heart attack, stroke, blood clots in lungs or legs).\n\nRARE SIDE EFFECTS: The provided text does not specify any side effects as rare.  The focus is on the serious potential side effects and the need for close monitoring.",
  "beclomethasone": "COMMON SIDE EFFECTS: headache, nasal irritation, stuffiness, or dryness, sneezing, nosebleed, joint or muscle pain, nausea, lightheadedness, unpleasant taste or smell, muscle weakness, bruising easily, menstrual period changes, acne, white patches in the throat, mouth, or nose.\n\nSERIOUS SIDE EFFECTS:  The provided text does not explicitly list serious side effects, but it does state that  users should tell their doctor if any of the listed side effects are severe or do not go away.\n\nRARE SIDE EFFECTS: The provided text does not specify which side effects are rare.",
  "benzphetamine": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.  It focuses heavily on serious side effects related to overdose and misuse.\n\nSERIOUS SIDE EFFECTS:  Fast, pounding, or irregular heartbeat; sweating; dilated pupils; abnormally excited mood; restlessness; irritability; difficulty falling asleep or staying asleep; hostility; aggression; anxiety; loss of appetite; loss of coordination; uncontrollable movement of a part of the body; flushed skin; vomiting; stomach pain; thinking about harming or killing oneself or others or planning or trying to do so; serious heart problems; sudden death; severe depression; extreme tiredness (upon sudden cessation after overuse).  Weight loss in children under 6 years of age (mentioned as a new safety concern by the FDA).\n\nRARE SIDE EFFECTS: The provided text does not specify rare side effects.",
  "berberine": "No side effects information found.",
  "bisoprolol": "COMMON SIDE EFFECTS: headache, dizziness, excessive tiredness, weakness, nausea or vomiting, diarrhea, muscle or joint pain, runny nose, cough, or sore throat, dry mouth, difficulty falling asleep or staying asleep.\n\nSERIOUS SIDE EFFECTS: shortness of breath, swelling of the hands, feet, ankles, or lower legs, unusual weight gain, fainting, chest pain.\n\nRARE SIDE EFFECTS:  The provided text does not specify which side effects are rare, only that some side effects are uncommon and require immediate medical attention.",
  "budesonide": "COMMON SIDE EFFECTS: headache, dizziness, runny nose, sneezing, coughing, nausea, indigestion, abdominal pain, dry, itchy skin, gas, vomiting, fatigue, back pain, joint pain or aches, muscle aches, spasms or cramps, difficulty sleeping, facial or extremity swelling, acne, weight gain, mood changes, facial hair.\n\nSERIOUS SIDE EFFECTS: rash, throat swelling, difficulty breathing, fever, cough, shortness of breath, abdominal pain, diarrhea, nausea, vomiting, changes in vision, bruising, swelling of the face, fatty pad or hump between your shoulders, easy bruising, stretch marks on the skin.\n\nRARE SIDE EFFECTS:  No specific rare side effects are listed.",
  "bupropion": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.\n\nSERIOUS SIDE EFFECTS: Suicidal thoughts or behavior (especially in children, teenagers, and young adults), new or worsening depression, extreme worry, agitation, panic attacks, sleep disturbances, aggressive behavior, irritability, acting without thinking, severe restlessness, and frenzied abnormal excitement.\n\nRARE SIDE EFFECTS: The provided text does not list rare side effects.",
  "calcitriol": "COMMON SIDE EFFECTS: skin pain or discomfort, itching\n\nSERIOUS SIDE EFFECTS:  None specified.  The page instructs users to contact their doctor if any unusual problems occur or if common side effects are severe or don't go away, implying the possibility of serious, unspecified side effects.\n\nRARE SIDE EFFECTS: Not specified.",
  "captopril": "COMMON SIDE EFFECTS: dizziness or lightheadedness, salty or metallic taste, or decreased ability to taste, cough, fast heartbeat, excessive tiredness\n\nSERIOUS SIDE EFFECTS: chest pain, swelling of the face, eyes, lips, tongue, arms, or legs, hives, hoarseness, difficulty breathing or swallowing, stomach pain, fainting, rash, itching, mouth sores, fever, sore throat, chills, and other signs of infection\n\nRARE SIDE EFFECTS:  No specific rare side effects are listed.",
  "carvedilol": "No side effects information found on this page.  While the page mentions that the medication may cause tiredness, dizziness, lightheadedness, and fainting,  it does not present this information in a structured side effect list.",
  "cefpodoxime": "COMMON SIDE EFFECTS: nausea, vomiting, diarrhea, stomach pain, swelling, redness, irritation, burning, or itching of the vagina, white vaginal discharge, headache.\n\nSERIOUS SIDE EFFECTS: watery or bloody stools, stomach cramps, fever (during treatment or up to two months after stopping treatment), rash, itching, hives, difficulty breathing or swallowing, wheezing, return of fever, sore throat, chills, or other signs of infection.\n\nRARE SIDE EFFECTS:  Not specified in the provided text.",
  "ceftriaxone": "COMMON SIDE EFFECTS: Pain, tenderness, hardness, or warmth at injection site; pale skin, weakness, or shortness of breath during exercise; diarrhea.\n\nSERIOUS SIDE EFFECTS: Rash; bloody or watery stools, stomach cramps, or fever (during or up to two months after treatment); stomach tenderness, pain, or bloating; nausea and vomiting; heartburn; chest pain; severe pain in the side and back below the ribs; painful urination; decreased urination; frequent urination.  \n\nRARE SIDE EFFECTS:  Not specified in the provided text.",
  "cefuroxime": "COMMON SIDE EFFECTS: Vaginal itching, diarrhea, pain, redness, swelling, or bleeding at injection site.\n\nSERIOUS SIDE EFFECTS: Watery or bloody stools, stomach cramps, or fever (during or up to two months after treatment); seizures; rash; hives; swelling of face, throat, tongue, lips, and eyes; difficulty swallowing or breathing; hoarseness; decreased urination; swelling in legs and feet; peeling, blistering, or shedding skin; return of fever, sore throat, chills, or other signs of infection; hearing loss (if treated for meningitis).\n\nRARE SIDE EFFECTS:  The provided text does not specify rare side effects, only that other unusual problems should be reported to a doctor.",
  "celecoxib": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.\n\nSERIOUS SIDE EFFECTS: Heart attack, stroke (may cause death), ulcers, bleeding, or holes in the stomach or intestine (may cause death).\n\nRARE SIDE EFFECTS: The provided text does not list rare side effects.",
  "certolizumab": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.  It focuses heavily on serious potential side effects.\n\nSERIOUS SIDE EFFECTS:  Serious infections (including fungal, bacterial, and viral infections, potentially life-threatening and requiring hospitalization);  severe or life-threatening cancers (including lymphoma and hepatosplenic T-cell lymphoma [HSTCL], especially in children, teenagers, and young adult males, often linked to concurrent use of azathioprine or 6-mercaptopurine); increased risk of certain cancers in adults (including skin cancer).  Reactivation of latent tuberculosis (TB) or hepatitis B.\n\nRARE SIDE EFFECTS: The text does not specify rare side effects separate from serious side effects.  The frequency of the listed serious side effects is not explicitly stated.",
  "cholestyramine": "COMMON SIDE EFFECTS: constipation, bloating, stomach pain, gas, upset stomach, vomiting, diarrhea, loss of appetite, heartburn, indigestion\n\nSERIOUS SIDE EFFECTS: unusual bleeding (such as bleeding from the gums or rectum)\n\nRARE SIDE EFFECTS:  No rare side effects are specifically listed.",
  "chondroitin": "No side effects information found.",
  "ciclesonide": "No side effects information found on this page.",
  "cilostazol": "COMMON SIDE EFFECTS: headache, diarrhea, dizziness, heartburn, nausea, stomach pain, muscle pain\n\nSERIOUS SIDE EFFECTS: fast or irregular heartbeat, unusual bleeding or bruising, swelling of the arms, hands, feet, ankles, or lower legs\n\nRARE SIDE EFFECTS:  Not specified in the provided text.",
  "cinacalcet": "COMMON SIDE EFFECTS: upset stomach, vomiting, diarrhea, dizziness, weakness, chest pain\n\nSERIOUS SIDE EFFECTS: burning, tingling, or unusual feelings of the lips, tongue, fingers, or feet; muscle aches or cramps; sudden tightening of the muscles in the hands, feet, face, or throat; seizures; infection of dialysis access.\n\nRARE SIDE EFFECTS:  The provided text does not specify which side effects are rare, only that some side effects are uncommon and warrant immediate medical attention.",
  "ciprofloxacin": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.\n\nSERIOUS SIDE EFFECTS: Tendinitis (swelling of a tendon), tendon rupture (tearing of a tendon), nerve damage (changes in sensation, numbness, tingling, pain), serious side effects affecting the brain or nervous system (seizures, tremors, dizziness, lightheadedness, persistent headaches, sleep disturbances, paranoia, hallucinations, suicidal thoughts, mood changes), worsening muscle weakness in people with myasthenia gravis (potentially leading to severe breathing difficulty or death).\n\nRARE SIDE EFFECTS: The provided text does not specifically list rare side effects, but implies that the serious side effects described above may be relatively uncommon based on the strong warnings and specific instructions given.",
  "citalopram": "COMMON SIDE EFFECTS:  The provided text mentions withdrawal symptoms as common when ceasing citalopram, including mood changes, irritability, agitation, dizziness, numbness, tingling or electric shock-like sensations in the hands or feet, anxiety, confusion, headache, tiredness, nausea, sweating, shaking, frenzied or abnormally excited mood, and difficulty falling asleep or staying asleep.\n\nSERIOUS SIDE EFFECTS: Suicidal thoughts or behaviors (especially in children, teenagers, and young adults), new or worsening depression, extreme worry, agitation, panic attacks, aggressive behavior, irritability, acting without thinking, severe restlessness, and frenzied abnormal excitement are listed as serious potential side effects requiring immediate medical attention.\n\nRARE SIDE EFFECTS:  The provided text does not specify rare side effects.",
  "clarithromycin": "COMMON SIDE EFFECTS: diarrhea, nausea, vomiting, stomach pain, heartburn, gas, change in taste, headache\n\nSERIOUS SIDE EFFECTS: chest pain, shortness of breath, trouble breathing, pain or weakness in one side of the body, slurred speech, severe diarrhea with watery or bloody stools (up to 2 months after treatment), rash, hives, itch\n\nRARE SIDE EFFECTS:  The provided text does not specify rare side effects.",
  "clonazepam": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.  It focuses heavily on serious and potentially life-threatening side effects associated with concurrent use of other medications, particularly opiates.\n\nSERIOUS SIDE EFFECTS:  Serious or life-threatening breathing problems, sedation, coma (especially when used with certain medications, particularly opiates); physical dependence (with unpleasant withdrawal symptoms if stopped suddenly, including new or worsening seizures, hallucinations, behavioral changes, sweating, shaking, cramps, anxiety, and sleep problems);  worsening of underlying conditions.\n\nRARE SIDE EFFECTS: The provided text does not specify rare side effects.  It focuses primarily on serious side effects related to interactions and withdrawal.",
  "clopidogrel": "COMMON SIDE EFFECTS: Excessive tiredness, headache, dizziness, nausea, vomiting, stomach pain, diarrhea, nosebleed.\n\nSERIOUS SIDE EFFECTS:  The provided text mentions that some side effects can be serious, but it does not list specific serious side effects.  It emphasizes the risk of increased bleeding and the importance of reporting any severe or persistent symptoms to a doctor.\n\nRARE SIDE EFFECTS:  No rare side effects are listed.",
  "clozapine": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.  It focuses on serious and potentially life-threatening side effects.\n\nSERIOUS SIDE EFFECTS:  Severe or life-threatening decrease in white blood cells (symptoms include extreme tiredness, weakness, fever, sore throat, chills, signs of infection, unusual vaginal discharge or itching, mouth or throat sores, slow-healing wounds, painful urination, rectal sores or pain, abdominal pain); seizures; serious or life-threatening heart inflammation or swelling, heart enlargement or hardening leading to impaired blood pumping (symptoms include extreme tiredness, flu-like symptoms, swollen legs/ankles/feet, difficulty breathing or rapid breathing, fever, chest pain, dizziness, fast/irregular/pounding heartbeat); potentially life-threatening low blood pressure and slow heart rates causing dizziness, lightheadedness, or fainting (especially when starting or increasing dosage).  Increased risk of death in older adults with dementia taking clozapine.\n\nRARE SIDE EFFECTS: The provided text does not specify rare side effects.",
  "colchicine": "COMMON SIDE EFFECTS: nausea, vomiting, diarrhea, stomach cramps or pain\n\nSERIOUS SIDE EFFECTS: muscle pain or weakness, numbness or tingling in the fingers or toes, unusual bruising or bleeding, sore throat, fever, chills, and other signs of infection, weakness or tiredness, paleness or grayness of the lips, tongue, or palms\n\nRARE SIDE EFFECTS:  Not specified on this page.",
  "colesevelam": "COMMON SIDE EFFECTS: Gas, constipation, nausea, vomiting, diarrhea, heartburn, stomach or back pain, headache, weakness, muscle pain.\n\nSERIOUS SIDE EFFECTS: Severe abdominal pain with or without nausea and vomiting.\n\nRARE SIDE EFFECTS:  No specific rare side effects are listed.",
  "colestipol": "COMMON SIDE EFFECTS: constipation, belching, nausea, vomiting, gas\n\nSERIOUS SIDE EFFECTS: unusual bleeding (such as bleeding from the gums or rectum)\n\nRARE SIDE EFFECTS:  Not specified on this page.",
  "dabigatran": "No side effects information found on this page.  The provided text mentions serious risks associated with stopping the medication suddenly and risks related to spinal procedures, but does not list common, serious, or rare side effects in a typical side effect profile format.",
  "desipramine": "COMMON SIDE EFFECTS:  The provided text does not list common side effects of desipramine.\n\nSERIOUS SIDE EFFECTS: Suicidal thoughts or behavior (especially in children, teenagers, and young adults), new or worsening depression, extreme worry, agitation, panic attacks, sleep disturbances, aggressive behavior, irritability, acting without thinking, severe restlessness, frenzied abnormal excitement.  These symptoms should be reported to a doctor immediately.\n\nRARE SIDE EFFECTS: The provided text does not specify rare side effects, but mentions potential withdrawal symptoms (nausea, headache, weakness) upon abrupt cessation of the medication.",
  "desvenlafaxine": "COMMON SIDE EFFECTS:  The provided text lists dizziness, confusion, nausea, headache, ringing in the ears, irritability, aggressive behavior, inability to control emotions, frequent mood changes, abnormally excited mood, difficulty falling asleep or staying asleep, diarrhea, anxiety, extreme tiredness, unusual dreams, seizures, sweating, uncontrollable shaking of a part of the body, blurred vision, and pain, burning or tingling in the hands or feet as potential withdrawal symptoms upon cessation or dose reduction of Desvenlafaxine.  These are not explicitly stated as common side effects during normal usage, however.\n\nSERIOUS SIDE EFFECTS: Suicidal thoughts or behavior (especially in children, teenagers, and young adults), new or worsening depression, extreme worry, agitation, panic attacks, aggressive behavior, severe restlessness, and frenzied abnormal excitement are listed as serious potential side effects requiring immediate medical attention.\n\nRARE SIDE EFFECTS:  The provided text does not specify any side effects as rare.",
  "dextroamphetamine": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.\n\nSERIOUS SIDE EFFECTS:  Fast, pounding, or irregular heartbeat; sweating; dilated pupils; abnormally excited mood; restlessness; irritability; difficulty falling asleep or staying asleep; hostility; aggression; anxiety; loss of appetite; loss of coordination; uncontrollable movement of a part of the body; flushed skin; vomiting; stomach pain; thinking about harming or killing oneself or others or planning or trying to do so; serious heart problems; sudden death; severe depression; extreme tiredness (upon abrupt cessation after overuse).\n\nRARE SIDE EFFECTS: The provided text does not list rare side effects.",
  "diclofenac": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.\n\nSERIOUS SIDE EFFECTS: Heart attack, stroke (may cause death), swelling, ulcers, bleeding, or holes in the stomach or intestine (may cause death).  Stomach pain, heartburn, vomiting blood or coffee-ground-like substance, blood in stool, or black and tarry stools.\n\nRARE SIDE EFFECTS: The provided text does not specify rare side effects.",
  "diethylpropion": "COMMON SIDE EFFECTS: dry mouth, unpleasant taste, restlessness, anxiety, dizziness, depression, tremors, upset stomach, vomiting, increased urination.\n\nSERIOUS SIDE EFFECTS: fast or irregular heartbeat, heart palpitations, blurred vision, skin rash, itching, difficulty breathing, chest pain, fainting, swelling of the ankles or feet, fever, sore throat, chills, painful urination.\n\nRARE SIDE EFFECTS:  The provided text does not specify rare side effects.",
  "digoxin": "COMMON SIDE EFFECTS: dizziness, lightheadedness, drowsiness, vision changes (blurred or yellow), rash, irregular heartbeat\n\nSERIOUS SIDE EFFECTS: upset stomach, vomiting, diarrhea, loss of appetite, swelling of the feet or hands, unusual weight gain, difficulty breathing\n\nRARE SIDE EFFECTS:  Not specified in the provided text.",
  "diltiazem": "COMMON SIDE EFFECTS: dizziness, lightheadedness, flushing, headache, weakness, slow heartbeat, vomiting, diarrhea, constipation, nasal congestion, cough.\n\nSERIOUS SIDE EFFECTS: swelling of the face, eyes, lips, tongue, hands, arms, feet, ankles, or lower legs; difficulty breathing or swallowing; fainting; rash; yellowing of the skin or eyes; nausea; extreme tiredness; unusual bleeding or bruising; lack of energy; loss of appetite; pain in the upper right part of the stomach; flu-like symptoms; increase in frequency or severity of chest pain (angina).\n\nRARE SIDE EFFECTS:  Not specified on this page.",
  "dipyridamole": "COMMON SIDE EFFECTS: Headache, heartburn, stomach pain, nausea, vomiting, diarrhea, muscle and joint pain, tiredness.\n\nSERIOUS SIDE EFFECTS: Bleeding, severe rash, swelling of the lips, tongue, or mouth, difficulty breathing.\n\nRARE SIDE EFFECTS:  No rare side effects are specifically listed.",
  "donanemab": "COMMON SIDE EFFECTS: Headache\n\nSERIOUS SIDE EFFECTS: Amyloid related imaging abnormalities (ARIA)  including temporary brain swelling, small spots of brain bleeding, and infrequently, larger areas of brain bleeding (symptoms may include headache, confusion, dizziness, vision changes, nausea, difficulty walking, loss of balance, or seizures);  severe infusion reactions (symptoms may include fever, chills, body aches, joint pain, nausea, vomiting, dizziness or lightheadedness, racing heart rate or chest pounding, difficulty breathing or shortness of breath); hives, rash, itching, swelling of the lips, tongue, or throat, shortness of breath or difficulty breathing; chills, redness of the skin, nausea, vomiting, difficulty breathing or shortness of breath, sweating, headache, chest pain, dizziness.\n\n\nRARE SIDE EFFECTS:  No specific rare side effects are listed, but the text mentions that other unusual problems may occur and should be reported to a doctor.",
  "donepezil": "COMMON SIDE EFFECTS: nausea, vomiting, diarrhea, loss of appetite, weight loss, frequent urination, difficulty controlling urination, muscle cramps, joint pain, swelling, or stiffness, pain, excessive tiredness, difficulty falling asleep or staying asleep, headache, dizziness, nervousness, depression, confusion, changes in behavior or mood, hallucinations, abnormal dreams, red, scaling, itchy skin.\n\nSERIOUS SIDE EFFECTS: fainting, slow heartbeat, chest pain, new or worsening breathing problems, new or worsening stomach pain or heartburn, black or tarry stools, red blood in stools, bloody vomit, vomit that looks like coffee grounds, difficulty urinating or pain when urinating, lower back pain, fever, seizures, discoloration or bruising of the skin.\n\nRARE SIDE EFFECTS:  Not specified in the provided text.",
  "doxepin": "COMMON SIDE EFFECTS: Nausea, dizziness\n\nSERIOUS SIDE EFFECTS:  The provided text does not list specific serious side effects, but it instructs the user to call their doctor if they have any unusual problems while taking the medication or experience a serious side effect.\n\nRARE SIDE EFFECTS: The provided text does not list rare side effects.",
  "doxycycline": "No side effects information found on this page.  While the page mentions \"side effects\" as a section heading, the content of that section is not included in the provided text.",
  "duloxetine": "COMMON SIDE EFFECTS:  The provided text does not list common side effects, but mentions withdrawal symptoms upon cessation of the drug, including nausea, vomiting, diarrhea, anxiety, dizziness, tiredness, headache, pain/burning/numbness/tingling in extremities, irritability, sleep disturbances, sweating, and nightmares.\n\nSERIOUS SIDE EFFECTS:  Suicidal thoughts or behavior, especially in children, teenagers, and young adults (up to 24 years of age), and worsening depression are mentioned as serious side effects.  New or worsening depression; thinking about harming or killing oneself, or planning or trying to do so; extreme worry; agitation; panic attacks; difficulty falling asleep or staying asleep; aggressive or hostile behavior; irritability; acting without thinking; severe restlessness; frenzied abnormal excitement; or any other unusual changes in behavior should prompt immediate medical attention.\n\nRARE SIDE EFFECTS:  The provided text does not specify rare side effects.",
  "edoxaban": "COMMON SIDE EFFECTS: rash, unusual tiredness or weakness, dizziness, pale skin\n\nSERIOUS SIDE EFFECTS: bleeding gums, nosebleeds, heavy vaginal bleeding, red, pink, or brown urine, red or black, tarry stools, coughing up or vomiting blood (Note:  The provided text cuts off before the full list of serious side effects is complete.  The listed serious side effects also overlap with symptoms described in the IMPORTANT WARNING section related to spinal hematoma.)\n\nRARE SIDE EFFECTS:  No specific rare side effects are listed.",
  "enalapril": "COMMON SIDE EFFECTS: cough, dizziness, headache, excessive tiredness, muscle cramps, decrease in sexual ability\n\nSERIOUS SIDE EFFECTS: lightheadedness\n\nRARE SIDE EFFECTS:  No rare side effects are specifically listed.",
  "enoxaparin": "COMMON SIDE EFFECTS: Upset stomach, fever, irritation or burning at the injection site.\n\nSERIOUS SIDE EFFECTS: Unusual bleeding or bruising, black or bloody stools, blood in urine, swollen ankles and/or feet.  The risk of spinal hematoma (blood clot in or around the spine) leading to paralysis is also mentioned as a serious risk, particularly in conjunction with epidural or spinal anesthesia/puncture.\n\nRARE SIDE EFFECTS:  The provided text does not specify rare side effects.",
  "erythromycin": "COMMON SIDE EFFECTS: upset stomach, diarrhea, vomiting, stomach pain, loss of appetite\n\nSERIOUS SIDE EFFECTS: rash, itching, hives, difficulty breathing or swallowing, wheezing, yellowing of the skin or eyes, dark urine, pale stools, unusual tiredness, pain in the upper right part of the stomach, seizures, fast, pounding, or irregular heartbeat, severe diarrhea (watery or bloody stools) that may occur with or without fever and stomach cramps (may occur up to 2 months or more after treatment).\n\nRARE SIDE EFFECTS:  The provided text does not specify any side effects as rare.",
  "erythropoietin": "COMMON SIDE EFFECTS:  The provided text focuses heavily on serious side effects and does not list common side effects.\n\nSERIOUS SIDE EFFECTS:  Blood clots (in legs, lungs, or brain); stroke; serious or life-threatening heart problems (heart attack, heart failure);  increased risk of death or tumor growth in certain cancer patients;  blood clots in vascular access (for hemodialysis patients).\n\nRARE SIDE EFFECTS: The provided text does not specify rare side effects.",
  "escitalopram": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.  It focuses primarily on serious side effects related to suicidality and withdrawal symptoms.\n\nSERIOUS SIDE EFFECTS: Suicidal thoughts or behaviors (especially in children, teenagers, and young adults), new or worsening depression, extreme worry, agitation, panic attacks, sleep disturbances, aggressive behavior, irritability, impulsive behavior, severe restlessness, frenzied abnormal excitement.  Withdrawal symptoms upon cessation (mood changes, irritability, agitation, nausea, dizziness, burning/numbness/tingling in extremities, anxiety, confusion, headache, sweating, shaking, frenzied or abnormally excited mood, tiredness, sleep disturbances) are also mentioned as a serious concern.\n\nRARE SIDE EFFECTS: The provided text does not specify rare side effects.",
  "etanercept": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.\n\nSERIOUS SIDE EFFECTS: Serious infections (viral, bacterial, or fungal; potentially fatal), tuberculosis (TB) reactivation, hepatitis B reactivation,  lymphoma (in children and teenagers), and other severe or life-threatening cancers.\n\nRARE SIDE EFFECTS: The provided text does not specify rare side effects beyond those listed as serious.",
  "evolocumab": "No side effects information found on this page.",
  "ezetimibe": "COMMON SIDE EFFECTS: diarrhea, sore throat, runny nose, sneezing, joint, back, arm, or leg pain\n\nSERIOUS SIDE EFFECTS: hives, rash, itching, difficulty breathing or swallowing, hoarseness, swelling of the face, throat, tongue, lips, or eyes, fast heartbeat, dizziness or fainting, upset stomach, extreme tiredness, unusual bleeding or bruising, lack of energy, loss of appetite, pain in the upper right part of the stomach, yellowing of the skin or eyes, flu-like symptoms, muscle pain or weakness, fever, chills, light-colored bowel movements\n\nRARE SIDE EFFECTS:  The provided text does not specify which side effects are rare, only that some are uncommon and should prompt immediate medical attention.",
  "fenofibrate": "COMMON SIDE EFFECTS: constipation, diarrhea, heartburn, pain in the back, arm, or legs, headache, joint pain\n\nSERIOUS SIDE EFFECTS: muscle pain, weakness, or tenderness; fever; blistering or peeling skin; rash; fever; trouble breathing; changes in urination; abdominal pain; hives; pain in the upper back between the shoulder blades or under the right shoulder; stomach pain (especially in the upper right part of the stomach); nausea; vomiting; redness, swelling, pain, tenderness, or warmth in one leg; shortness of breath; pain when breathing; coughing up blood; swelling of the face, throat, tongue, lips, and eyes; difficulty swallowing or breathing; hoarseness\n\nRARE SIDE EFFECTS:  Not specified in the provided text.",
  "fluoxetine": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.  It focuses primarily on the risk of suicidality, especially in young adults.\n\nSERIOUS SIDE EFFECTS: Suicidal thoughts or behavior (thinking about harming or killing oneself, or planning or trying to do so); new or worsening depression; extreme worry; agitation; panic attacks; sleep disturbances; aggressive behavior; irritability; acting without thinking; severe restlessness; frenzied abnormal excitement; withdrawal symptoms (mood changes, irritability, agitation, dizziness, numbness or tingling, anxiety, sweating, confusion, headache, tiredness, sleep disturbances) upon abrupt cessation.\n\nRARE SIDE EFFECTS: The provided text does not specify rare side effects.",
  "fluticasone": "No side effects information found on this page.",
  "fluvastatin": "COMMON SIDE EFFECTS: headache, heartburn, difficulty sleeping, sinus pain, cough, memory loss or forgetfulness, confusion.\n\nSERIOUS SIDE EFFECTS: muscle pain, tenderness, or weakness; lack of energy; fever; yellowing of the skin or eyes; pain in the upper right part of the stomach; dark colored urine; nausea; extreme tiredness; unusual bleeding or bruising; loss of appetite; flu-like symptoms; rash; hives; itching; difficulty breathing or swallowing; swelling of the face, throat, tongue, lips, eyes, hands, feet, ankles, or lower legs; hoarseness.\n\nRARE SIDE EFFECTS:  The provided text does not specify rare side effects.",
  "formoterol": "No side effects information found on this page.",
  "furosemide": "COMMON SIDE EFFECTS: frequent urination, blurred vision, headache, constipation, diarrhea\n\nSERIOUS SIDE EFFECTS: decreased urination, dry mouth, thirst, nausea, vomiting, weakness, drowsiness, confusion, muscle pain or cramps, rapid or pounding heartbeats, fever, ringing in the ears, loss of hearing, itching, rash, hives, blisters or peeling skin, difficulty breathing or swallowing, yellowing of the skin or eyes\n\nRARE SIDE EFFECTS:  Not specified in the provided text.",
  "gabapentin": "No side effects information found on this page.  While the page mentions side effects as a section, the content for that section is missing.",
  "galantamine": "COMMON SIDE EFFECTS: nausea, vomiting, diarrhea, loss of appetite, stomach pain, heartburn, weight loss, extreme tiredness, dizziness, pale skin, headaches, shaking of a body part (involuntary), depression, difficulty sleeping (falling asleep or staying asleep), runny nose.\n\nSERIOUS SIDE EFFECTS: difficulty urinating, blood in urine, pain or burning during urination, seizures, slowed heartbeat, fainting, shortness of breath, black and tarry stools, red blood in stools, bloody vomit, vomit resembling coffee grounds.\n\nRARE SIDE EFFECTS:  Not explicitly specified in the provided text.",
  "garlic": "No side effects information found.",
  "gemfibrozil": "COMMON SIDE EFFECTS: stomach pain, heartburn\n\nSERIOUS SIDE EFFECTS: muscle pain, tenderness, or weakness, blurred vision\n\nRARE SIDE EFFECTS:  The provided text mentions that a similar medication (clofibrate) has been linked to cancer, gallbladder disease, and stomach pain leading to appendectomy, but doesn't explicitly state these as rare side effects of gemfibrozil itself.",
  "glimepiride": "No side effects information found on this page.  While the page discusses interactions with other medications and alcohol, it does not list specific side effects of glimepiride itself.",
  "glipizide": "No side effects information found on this page.  While the provided text mentions potential interactions with other medications and alcohol, and notes that glipizide may increase sun sensitivity, a dedicated section detailing side effects is absent.",
  "glucosamine": "No side effects information found.",
  "glycopyrrolate": "COMMON SIDE EFFECTS: diarrhea, nausea, abdominal pain, back or joint pain, headache, extreme tiredness, swelling of the arms or legs, sore throat\n\nSERIOUS SIDE EFFECTS: sudden shortness of breath immediately after use, rash, hives, difficulty swallowing or breathing, swelling of the face, throat, tongue, lips, and eyes, hoarseness, eye pain, red eyes, nausea, vomiting, blurred vision, seeing bright circles around lights or other colored images, difficult, frequent, painful, or weak urination\n\nRARE SIDE EFFECTS:  No specific rare side effects are listed.",
  "golimumab": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.  It focuses heavily on serious and potentially life-threatening side effects.\n\nSERIOUS SIDE EFFECTS: Serious infections (including fungal, bacterial, or viral infections potentially fatal),  worsening of existing tuberculosis or hepatitis B,  severe or life-threatening cancers (including lymphoma and hepatosplenic T-cell lymphoma [HSTCL], especially in teenagers and young adults, particularly those also taking azathioprine or 6-mercaptopurine).\n\nRARE SIDE EFFECTS: The provided text does not specifically list rare side effects, but implies that the serious side effects described above are relatively uncommon given the extensive warnings provided.",
  "haloperidol": "No side effects information found on this page.  The page mentions that side effects *may* occur but does not list them.",
  "heparin": "COMMON SIDE EFFECTS:  The provided text only states that heparin may cause side effects and to tell your doctor if any symptoms are severe or don't go away,  listing redness, pain, bruising, or sores at the injection site as examples.  No frequency or prevalence data is given for these or any other side effects.\n\nSERIOUS SIDE EFFECTS:  The text does not explicitly list serious side effects, but implies that incorrect dosage could cause serious problems.  It also mentions that patients should inform their doctor of heavy, unstoppaple bleeding.\n\nRARE SIDE EFFECTS: No rare side effects are mentioned.",
  "hydrochlorothiazide": "COMMON SIDE EFFECTS: Frequent urination, diarrhea, loss of appetite, headache, hair loss.\n\nSERIOUS SIDE EFFECTS: Dry mouth, thirst, nausea, vomiting, weakness, tiredness, drowsiness, restlessness, confusion, muscle weakness, pain, or cramps; fast heartbeat (signs of dehydration and electrolyte imbalance), blisters or peeling skin, hives, rash, itching, difficulty breathing or swallowing, fever, sore throat, chills (signs of infection), unusual bleeding or bruising, ongoing pain starting in the stomach and spreading to the back, joint pain or swelling, changes in vision, eye pain, or swelling or redness in or around the eye.\n\nRARE SIDE EFFECTS:  The provided text does not specify rare side effects.",
  "hydroxychloroquine": "COMMON SIDE EFFECTS: headache, loss of appetite, nausea, diarrhea, stomach pain, vomiting, difficulty hearing, ringing in the ears, hair loss, hair color changes.\n\nSERIOUS SIDE EFFECTS: hives, rash, swelling of the face, eyes, mouth, throat, tongue, lips, hands, feet, ankles, or lower legs, difficulty breathing or swallowing, blisters on the skin, eyes, lips, or in the mouth, itching.  Serious and potentially irreversible eye problems (blurred vision, floaters, flashes of light, vision changes). Hypoglycemia (low blood sugar) with symptoms including dizziness, weakness, tiredness, sweating, nausea, rapid or irregular heartbeat, confusion, fainting, or loss of consciousness.\n\nRARE SIDE EFFECTS:  The provided text does not specify rare side effects.",
  "ibuprofen": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.\n\nSERIOUS SIDE EFFECTS:  Heart attack, stroke (possibly fatal, may occur without warning; risk increased with long-term use or high doses), ulcers, bleeding, or holes in the esophagus, stomach, or intestine (possibly fatal, may occur without warning; risk increased with long-term use, older age, poor health, smoking, or excessive alcohol consumption).\n\nRARE SIDE EFFECTS: The provided text does not list rare side effects.",
  "imipenem": "COMMON SIDE EFFECTS: nausea, vomiting, diarrhea, headache, swelling, pain, or redness at injection site.\n\nSERIOUS SIDE EFFECTS: severe diarrhea (watery or bloody stools) with or without fever and stomach cramps (may occur up to 2 months after treatment), seizures, confusion, uncontrolled muscle jerks, shakes, or spasms, rash, hives, swelling of the eyes, face, lips, or throat, difficulty swallowing or breathing.\n\nRARE SIDE EFFECTS:  The provided text does not specify rare side effects.",
  "imipramine": "COMMON SIDE EFFECTS:  The provided text does not list common side effects of Imipramine.\n\nSERIOUS SIDE EFFECTS: Suicidal thoughts or behavior (especially in children, teenagers, and young adults), new or worsening depression, extreme worry, agitation, panic attacks, sleep disturbances, aggressive behavior, irritability, impulsive behavior, severe restlessness, and frenzied abnormal excitement.\n\nRARE SIDE EFFECTS: The provided text does not list rare side effects of Imipramine.",
  "inclisiran": "COMMON SIDE EFFECTS: pain, swelling, redness at injection site; joint pain; pain or burning on urination; loose or frequent stools; cough, shortness of breath, wheezing, low fever or chest tightness; pain in arms or legs; difficulty breathing.\n\nSERIOUS SIDE EFFECTS:  The provided text does not specifically list serious side effects, but it advises calling a doctor if any unusual problems occur or if any listed side effects are severe or don't go away.  It also directs users to report serious side effects to the FDA's MedWatch program.\n\nRARE SIDE EFFECTS: The provided text does not list rare side effects.",
  "indomethacin": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.\n\nSERIOUS SIDE EFFECTS: Heart attack, stroke (may cause death), ulcers, bleeding, or holes in the stomach or intestine (may cause death).\n\nRARE SIDE EFFECTS: The provided text does not list rare side effects.",
  "infliximab": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.  It focuses heavily on serious potential side effects associated with immune suppression.\n\nSERIOUS SIDE EFFECTS:  Serious infections (viral, bacterial, fungal; potentially fatal), tuberculosis reactivation (with symptoms including cough, weight loss, muscle loss, fever, night sweats), hepatitis B reactivation (with symptoms including fatigue, jaundice, loss of appetite, nausea, vomiting, muscle aches, dark urine, clay-colored stools, fever, chills, abdominal pain, rash), severe or life-threatening cancers (including lymphoma and hepatosplenic T-cell lymphoma [HSTCL], especially in teenagers and young adults, particularly those also taking azathioprine or 6-mercaptopurine).  Symptoms of cancer may include unexplained weight loss, swollen lymph nodes, and easy bruising/bleeding.\n\nRARE SIDE EFFECTS: The provided text does not specifically list rare side effects, but implies that the serious side effects listed above may be relatively uncommon occurrences.",
  "insulin": "No side effects information found on this page.",
  "ipratropium": "COMMON SIDE EFFECTS: nose dryness or irritation, nosebleeds, dry throat or mouth, sore throat, changes in taste, headache, diarrhea, nausea.\n\nSERIOUS SIDE EFFECTS: rash, hives, itching, swelling of the eyes, face, lips, tongue, throat, hands, feet, ankles, or lower legs, hoarseness, difficulty breathing or swallowing.  (Note:  blurred vision, seeing visual halos or colored images, red eyes, development or worsening of narrow-angle glaucoma, widened pupils, sudden eye pain, and increased sensitivity to light are listed as symptoms that occur if the spray gets in the eyes, and the user should contact their doctor immediately.)\n\nRARE SIDE EFFECTS:  Not specified in the provided text.",
  "irbesartan": "COMMON SIDE EFFECTS: diarrhea, heartburn, excessive tiredness\n\nSERIOUS SIDE EFFECTS: swelling of the face, throat, tongue, lips, eyes, hands, feet, ankles, or lower legs; hoarseness; difficulty breathing or swallowing\n\nRARE SIDE EFFECTS:  No specific rare side effects are listed.",
  "isocarboxazid": "COMMON SIDE EFFECTS:  The provided text does not list common side effects of Isocarboxazid.\n\nSERIOUS SIDE EFFECTS: Suicidal thoughts or behavior (especially in children, teenagers, and young adults), new or worsening depression, extreme worry, agitation, panic attacks, sleep disturbances, aggressive behavior, irritability, acting without thinking, severe restlessness, and frenzied abnormal excitement.\n\nRARE SIDE EFFECTS: The provided text does not list rare side effects of Isocarboxazid.",
  "lamotrigine": "COMMON SIDE EFFECTS: The provided text focuses heavily on the risk of serious rashes, including blistering, peeling skin, hives, itching, and painful sores in the mouth or around the eyes.  These are listed as symptoms to report immediately to a doctor.\n\nSERIOUS SIDE EFFECTS:  Serious rashes are explicitly identified as a serious side effect, potentially leading to hospitalization, permanent disability, or death.  The risk is higher with higher starting doses or faster dose increases and in children aged 2-17.\n\nRARE SIDE EFFECTS:  The text does not specify any side effects as rare.",
  "lecanemab": "COMMON SIDE EFFECTS: cough, diarrhea\n\nSERIOUS SIDE EFFECTS: amyloid related imaging abnormalities (ARIA; swelling and bleeding in the brain – symptoms include headache, confusion, dizziness, vision changes, nausea, difficulty walking or loss of balance, or seizures), hives, rash, itching, swelling of the lips, tongue, or throat, shortness of breath or difficulty breathing, severe reactions during or shortly after infusion (fever, chills, body aches, joint pain, nausea, vomiting, dizziness or lightheadedness, feeling of racing heart rate or chest pounding, or difficulty breathing or shortness of breath).\n\nRARE SIDE EFFECTS:  The provided text does not specify rare side effects.",
  "leflunomide": "The provided text mentions several potential side effects of Leflunomide, but doesn't explicitly categorize them as common, serious, or rare.  The information focuses heavily on potential liver damage and the need for pregnancy prevention.  Therefore, a precise categorization isn't possible based solely on the provided text.\n\n**Potential Side Effects (Severity unclear):**\n\n* **Liver damage:**  This is highlighted as a potentially life-threatening side effect, requiring immediate medical attention if symptoms like nausea, extreme tiredness, unusual bleeding or bruising, lack of energy, loss of appetite, upper right stomach pain, yellowing skin or eyes, dark urine, or flu-like symptoms occur.  Pre-existing liver disease increases this risk.\n\n* **Increased risk of infection:** Leflunomide may decrease the body's ability to fight infection.  Symptoms such as fever, sore throat, cough, flu-like symptoms, skin redness/swelling/pain, painful urination, or other infection signs necessitate contacting a doctor; treatment may be interrupted.  Pre-existing infections or weakened immune systems are risk factors.\n\n* **Fetal harm:** The text strongly warns against use during pregnancy or attempts to conceive (for both men and women) due to potential harm to the fetus.  A two-year period of birth control post-treatment is advised.",
  "levalbuterol": "No side effects information found on this page.",
  "levetiracetam": "COMMON SIDE EFFECTS: weakness, unsteady walking, dizziness, confusion, headache, loss of appetite, vomiting, diarrhea, constipation, excessive sleepiness, joint pain, neck pain, double vision, nasal congestion.\n\nSERIOUS SIDE EFFECTS: rash, fever, swollen lymph nodes, facial swelling, shortness of breath, yellowing of skin or whites of eyes, dark urine, worsening or different seizures.  Suicidal thoughts or behavior (including panic attacks, agitation, restlessness, irritability, anxiety, depression, acting on dangerous impulses, sleep disturbances, aggressive behavior, mania, preoccupation with death, giving away possessions, or other unusual behavior or mood changes).\n\nRARE SIDE EFFECTS:  Not specified in the provided text.",
  "levofloxacin": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.\n\nSERIOUS SIDE EFFECTS: Tendinitis (swelling of a tendon), tendon rupture, nerve damage (peripheral neuropathy causing tingling, numbness, and pain), central nervous system effects (seizures, tremors, dizziness, lightheadedness, persistent headaches, sleep disturbances, paranoia, hallucinations, suicidal thoughts, mood changes), worsened muscle weakness in individuals with myasthenia gravis (potentially leading to severe breathing difficulties or death).\n\nRARE SIDE EFFECTS: The provided text does not specify rare side effects; however,  the severity of the listed serious side effects implies that they may be relatively infrequent compared to other, less serious side effects not mentioned.",
  "levomilnacipran": "COMMON SIDE EFFECTS:  The provided text does not list common side effects of Levomilnacipran.  It focuses primarily on the risk of suicidality, particularly in young adults and children.  Withdrawal symptoms upon cessation are mentioned, including mood changes, agitation, irritability, dizziness, ringing in the ears, shock-like sensations, anxiety, confusion, tiredness, sleep disturbances, numbness/tingling, headache, increased sweating, seizures, and nausea.\n\nSERIOUS SIDE EFFECTS: Suicidal thoughts or behavior (especially in young adults and children), worsening depression.\n\nRARE SIDE EFFECTS:  The text does not specify rare side effects.",
  "linezolid": "COMMON SIDE EFFECTS: diarrhea, headache, nausea, vomiting, stomach pain, change in taste, rash, itching, dizziness, white patches in the mouth, irritation/burning/itching of the vagina, change in tongue or teeth color.\n\nSERIOUS SIDE EFFECTS: hives, rash, itching, difficulty breathing or swallowing, swelling of face/throat/tongue/lips/eyes/hands/feet/or hoarseness, blistering or peeling skin, repeated nausea and vomiting, fast breathing, confusion, fatigue, pain/numbness/weakness in extremities, severe diarrhea (watery or bloody stools, possibly with fever and stomach cramps), unusual bleeding or bruising, changes in color vision/blurred vision/other vision changes, seizures, muscle pain/tenderness/weakness, dark urine.\n\nRARE SIDE EFFECTS:  Not specifically listed as rare, but the phrasing implies less common occurrence for some serious side effects.",
  "liraglutide": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.\n\nSERIOUS SIDE EFFECTS:  Thyroid tumors (including a type of thyroid cancer).  Pancreatitis (inflammation of the pancreas) is mentioned as a pre-existing condition that should be disclosed to a doctor before starting the medication, suggesting it could be exacerbated or triggered by the drug.\n\nRARE SIDE EFFECTS: The provided text does not specify rare side effects.",
  "lisinopril": "COMMON SIDE EFFECTS: cough, dizziness, headache, excessive tiredness, nausea, diarrhea, weakness, sneezing, runny nose, decrease in sexual ability, rash\n\nSERIOUS SIDE EFFECTS: swelling of the face, throat, tongue, lips, eyes, hands, feet, ankles, or lower legs; hoarseness; difficulty breathing or swallowing; fever, sore throat, chills, and other signs of infection; yellowing of the skin or eyes; lightheadedness; fainting; chest pain\n\nRARE SIDE EFFECTS:  Not specified in the provided text.",
  "lithium": "COMMON SIDE EFFECTS: restlessness, fine hand movements (difficult to control), mild thirst, loss of appetite, stomach pain, gas, indigestion, weight gain or loss, dry mouth, excessive saliva, change in taste, swollen lips, acne, hair loss, unusual cold sensitivity, constipation, depression, joint or muscle pain, paleness, thin/brittle nails, itching, rash.\n\nSERIOUS SIDE EFFECTS: unusual tiredness/weakness, excessive thirst, frequent urination, slow/jerky movements, unusual/difficult-to-control movements, blackouts, seizures, fainting, dizziness/lightheadedness, fast/slow/irregular/pounding heartbeat, shortness of breath, chest tightness, confusion, hallucinations, crossed eyes, painful/cold/discolored fingers/toes, headache, pounding noises in head, swelling of feet/ankles/lower legs.\n\nRARE SIDE EFFECTS:  None specifically listed as rare, but the text implies that the serious side effects are less common than the common side effects.",
  "lorazepam": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.\n\nSERIOUS SIDE EFFECTS:  Serious or life-threatening breathing problems, sedation, coma (especially when used with certain medications like opiates); physical dependence (with unpleasant withdrawal symptoms if stopped suddenly, including unusual movements, ringing in ears, anxiety, memory problems, difficulty concentrating, sleep problems, seizures, shaking, muscle twitching, changes in mental health, aggression, depression, burning/prickling sensations, hallucinations, thoughts of self-harm or harming others, overexcitement, loss of touch with reality).\n\nRARE SIDE EFFECTS: The provided text does not specify rare side effects.",
  "lorcaserin": "COMMON SIDE EFFECTS: constipation, dry mouth, excessive tiredness, back or muscle pain, headache, dizziness, difficulty sleeping, anxiety, difficult/painful/frequent urination, cough, toothache, blurred vision, dry eyes.\n\nSERIOUS SIDE EFFECTS: agitation, confusion, hallucinations, difficulty with coordination, muscle spasms/stiffness/twitching, restlessness, fast/slow/irregular heartbeat, sweating, fever, nausea, vomiting, diarrhea, difficulty breathing, swelling of extremities, difficulty paying attention/remembering information, depression, suicidal thoughts, feeling euphoric or detached from reality, prolonged erection, breast discharge, male breast enlargement.\n\nRARE SIDE EFFECTS:  The provided text does not specify which side effects are rare, only that some are serious.  The increased cancer risk mentioned in the notice is a serious concern, but not listed as a direct side effect in the side effect section.",
  "losartan": "COMMON SIDE EFFECTS: leg, knee, or back pain; muscle cramps or weakness; diarrhea; heartburn; decreased sensitivity to touch.\n\nSERIOUS SIDE EFFECTS: swelling of the face, throat, tongue, lips, eyes, hands, feet, ankles, or lower legs; hoarseness; difficulty breathing or swallowing; chest pain.\n\nRARE SIDE EFFECTS:  No rare side effects are specifically listed.",
  "lovastatin": "COMMON SIDE EFFECTS: constipation, memory loss or forgetfulness, confusion, headache\n\nSERIOUS SIDE EFFECTS: muscle pain, tenderness, or weakness; lack of energy; weakness; fever; dark colored urine; yellowing of the skin or eyes; pain in the upper right part of the stomach; extreme tiredness; nausea; unusual bleeding or bruising; loss of appetite; flu-like symptoms; rash; hives; itching; difficulty breathing or swallowing; swelling of the face, throat, tongue, lips, eyes, hands, feet, ankles, or lower legs; hoarseness\n\nRARE SIDE EFFECTS:  The provided text does not specify which side effects are rare, only that some are uncommon and warrant immediate medical attention.",
  "mannitol": "No side effects information found.",
  "meloxicam": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.\n\nSERIOUS SIDE EFFECTS:  Heart attack, stroke (may occur without warning and cause death); ulcers, bleeding, or holes in the stomach or intestine (may develop at any time, without warning, and cause death).\n\nRARE SIDE EFFECTS: The provided text does not list rare side effects.",
  "memantine": "COMMON SIDE EFFECTS: dizziness, confusion, aggression, depression, headache, sleepiness, diarrhea, constipation, nausea, vomiting, weight gain, pain (anywhere in the body, especially the back), cough.\n\nSERIOUS SIDE EFFECTS: shortness of breath, hallucinations (seeing or hearing things that do not exist).\n\nRARE SIDE EFFECTS:  No specific rare side effects are listed.",
  "meropenem": "COMMON SIDE EFFECTS: headache, diarrhea, nausea, redness, pain, or swelling at the injection site, burning or tingling in the hands or feet, confusion.\n\nSERIOUS SIDE EFFECTS: seizures, hives, itching, rash, flushing, swelling of the face, throat, tongue, lips, and eyes, difficulty swallowing or breathing, severe diarrhea (watery or bloody stools) that may occur with or without fever and stomach cramps (may occur up to 2 months or more after treatment), a return of fever or other signs of infection.\n\nRARE SIDE EFFECTS:  Not specified on this page.",
  "metformin": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.\n\nSERIOUS SIDE EFFECTS: Lactic acidosis (a life-threatening condition).  Symptoms include extreme tiredness, weakness, discomfort, nausea, vomiting, stomach pain, decreased appetite, deep and rapid breathing or shortness of breath, dizziness, lightheadedness, fast or slow heartbeat, muscle pain, or feeling cold (especially in hands or feet).\n\nRARE SIDE EFFECTS: The provided text does not specifically list rare side effects, but implies that lactic acidosis is a rare but serious occurrence.",
  "methotrexate": "COMMON SIDE EFFECTS:  The provided text does not explicitly list common side effects, but mentions numerous serious side effects that could be considered common in some patient populations given the frequency of mention and warnings.  These include mouth sores, nausea, diarrhea, and fatigue.\n\nSERIOUS SIDE EFFECTS: Life-threatening birth defects/death of unborn baby; serious allergic reactions (rash, itching, hives, stomach pain, difficulty breathing, shortness of breath, wheezing, fast heartbeat, swelling of face/tongue/throat, fainting); decreased blood cell production (leading to increased infection risk and bleeding); severe/life-threatening liver damage; severe/life-threatening lung damage; damage to mouth, stomach, or intestine lining (mouth sores, worsening diarrhea, vomiting, fever, chills, severe stomach pain, bloody stools, bloody vomit); serious/life-threatening skin reactions (fever, rash, blisters, peeling skin); serious kidney problems, including kidney failure.\n\nRARE SIDE EFFECTS: The provided text does not specify rare side effects.",
  "methylphenidate": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.\n\nSERIOUS SIDE EFFECTS:  Fast, pounding, or irregular heartbeat; sweating; dilated pupils; abnormally excited mood; restlessness; difficulty sleeping; hostility; aggression; anxiety; loss of appetite; loss of coordination; uncontrollable movement of a body part; flushed skin; vomiting; stomach pain; thoughts of harming or killing oneself or others; severe depression (upon sudden cessation after overuse).\n\nRARE SIDE EFFECTS: The provided text does not list rare side effects.",
  "methylprednisolone": "COMMON SIDE EFFECTS:  The provided text does not list common side effects, only stating that methylprednisolone injection \"may cause side effects\" and to tell the doctor if any symptoms are severe or don't go away.  No specific common side effects are detailed.\n\nSERIOUS SIDE EFFECTS: No serious side effects are explicitly listed.\n\nRARE SIDE EFFECTS: No rare side effects are mentioned.",
  "metoprolol": "COMMON SIDE EFFECTS: dizziness or lightheadedness, tiredness, depression, diarrhea, nausea, dry mouth, stomach pain, vomiting, gas or bloating, heartburn, constipation, rash or itching, cold hands and feet, runny nose.\n\nSERIOUS SIDE EFFECTS: shortness of breath or difficulty breathing.\n\nRARE SIDE EFFECTS:  The provided text does not specify which side effects are rare, only that some are uncommon and require immediate medical attention if experienced.",
  "mirtazapine": "COMMON SIDE EFFECTS:  The provided text does not list common side effects of Mirtazapine.\n\nSERIOUS SIDE EFFECTS: Suicidal thoughts or behavior (especially in children, teenagers, and young adults), new or worsening depression, extreme worry, agitation, panic attacks, sleep disturbances, aggressive behavior, irritability, impulsive behavior, severe restlessness, and frenzied abnormal excitement.\n\nRARE SIDE EFFECTS: The provided text does not list rare side effects of Mirtazapine.",
  "mometasone": "No side effects information found on this page.",
  "morphine": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.  It focuses heavily on serious potential side effects related to respiratory depression and the risk of addiction.\n\nSERIOUS SIDE EFFECTS:  Serious or life-threatening breathing problems (especially within the first 72 hours of treatment or when the dose is increased), slowed breathing, long pauses between breaths, shortness of breath, sedation, coma,  overdose (potentially fatal), and life-threatening withdrawal symptoms in newborns whose mothers took morphine regularly during pregnancy.  The risk of these is increased by concurrent use of alcohol or other CNS depressants.\n\nRARE SIDE EFFECTS: The provided text does not specify rare side effects.",
  "naltrexone": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.\n\nSERIOUS SIDE EFFECTS: Liver damage (especially with high doses), opiate overdose (if opiates are used during treatment),  withdrawal symptoms (if stopping opiates before starting treatment).\n\nRARE SIDE EFFECTS: The provided text does not specify rare side effects.",
  "naproxen": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.\n\nSERIOUS SIDE EFFECTS: Heart attack, stroke (may cause death), ulcers, bleeding, or holes in the esophagus, stomach, or intestine (may cause death).\n\nRARE SIDE EFFECTS: The provided text does not specify rare side effects.  The text focuses on serious potential side effects related to cardiovascular events and gastrointestinal issues.",
  "nefazodone": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.  It focuses on serious potential side effects and warnings.\n\nSERIOUS SIDE EFFECTS: Suicidal thoughts or behavior (especially in children, teenagers, and young adults); liver damage (nausea, vomiting, loss of appetite, extreme tiredness, lack of energy, yellowing of skin or eyes, unusual bleeding or bruising, dark urine, upper right stomach pain, flu-like symptoms).\n\nRARE SIDE EFFECTS: The provided text does not specify rare side effects.",
  "niacin": "COMMON SIDE EFFECTS: Diarrhea, increased cough, flushing (redness, warmth, itching, tingling of face, neck, chest, or back).  Flushing usually subsides after several weeks of use.\n\nSERIOUS SIDE EFFECTS:  The provided text does not list specific serious side effects.\n\nRARE SIDE EFFECTS: The provided text does not list specific rare side effects.",
  "nicotine": "COMMON SIDE EFFECTS: hot, peppery feeling in the back of the nose or throat; runny nose; throat irritation; watery eyes; sneezing; coughing.\n\nSERIOUS SIDE EFFECTS: rapid heart rate\n\nRARE SIDE EFFECTS:  No specific rare side effects are listed.",
  "nifedipine": "COMMON SIDE EFFECTS: headache, nausea, dizziness or lightheadedness, flushing, heartburn, fast heartbeat, muscle cramps, constipation, cough, decreased sexual ability\n\nSERIOUS SIDE EFFECTS: swelling of the face, eyes, lips, tongue, hands, arms, feet, ankles, or lower legs; difficulty breathing or swallowing; fainting; rash; yellowing of the skin or eyes; increase in frequency or severity of chest pain (angina)\n\nRARE SIDE EFFECTS:  Not specified in the provided text.",
  "nimodipine": "COMMON SIDE EFFECTS: Headache, diarrhea, nausea, muscle pain, rash.\n\nSERIOUS SIDE EFFECTS: Dizziness, lightheadedness, slow or fast heartbeats, swelling of the arms, hands, feet, or legs.\n\nRARE SIDE EFFECTS:  Not specified on this page.",
  "nitroglycerin": "No side effects information found on this page.",
  "nortriptyline": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.\n\nSERIOUS SIDE EFFECTS: Suicidal thoughts or behavior (especially in children, teenagers, and young adults), new or worsening depression, extreme worry, agitation, panic attacks, sleep problems, aggressive behavior, irritability, acting without thinking, severe restlessness, and frenzied abnormal excitement.\n\nRARE SIDE EFFECTS: The provided text does not specify rare side effects.  It mentions withdrawal symptoms (headache, nausea, and weakness) upon sudden cessation, but doesn't classify these as rare.",
  "olanzapine": "No side effects information found on this page.  While the page discusses precautions and warnings related to the medication's use, it does not list specific side effects.",
  "olodaterol": "No side effects information found on this page.",
  "omega": "COMMON SIDE EFFECTS: burping, heartburn, stomach pain or discomfort, joint pain, vomiting, constipation, diarrhea, nausea, change in the sense of taste.\n\nSERIOUS SIDE EFFECTS:  The provided text does not specify serious side effects, but it encourages reporting any unusual problems or serious side effects to a doctor or the FDA's MedWatch program.\n\nRARE SIDE EFFECTS: The provided text does not list rare side effects.",
  "orlistat": "COMMON SIDE EFFECTS: Changes in bowel movement habits (oily spotting on underwear or clothing, gas with oily spotting, urgent need to have a bowel movement, loose stools, oily or fatty stools, increased number of bowel movements, difficulty controlling bowel movements, pain or discomfort in the rectum, stomach pain), headache, anxiety, irregular menstrual periods.\n\nSERIOUS SIDE EFFECTS: Hives, rash, itching, difficulty breathing or swallowing, severe or continuous stomach pain, excessive tiredness.\n\nRARE SIDE EFFECTS:  No rare side effects are specifically listed.",
  "oseltamivir": "No side effects information found on this page.",
  "paroxetine": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.\n\nSERIOUS SIDE EFFECTS: Suicidal thoughts or behavior (especially in children, teenagers, and young adults), new or worsening depression, extreme worry, agitation, panic attacks, sleep problems, aggressive behavior, irritability, acting without thinking, severe restlessness, and frenzied abnormal excitement.\n\nRARE SIDE EFFECTS: The provided text does not list rare side effects.",
  "phendimetrazine": "No side effects information found.",
  "phenelzine": "COMMON SIDE EFFECTS:  The provided text does not list common side effects of phenelzine.\n\nSERIOUS SIDE EFFECTS: Suicidal thoughts or behavior (especially in children, teenagers, and young adults), new or worsening depression, extreme worry, agitation, panic attacks, sleep disturbances, aggressive behavior, irritability, acting without thinking, severe restlessness, and frenzied abnormal excitement.  Withdrawal symptoms (nightmares, agitation, loss of contact with reality, nausea, vomiting, and weakness) upon sudden cessation are also mentioned.\n\nRARE SIDE EFFECTS: The provided text does not specify rare side effects.",
  "phentermine": "No side effects information found on this page.  While the page mentions side effects as a section header, the content of that section is not included in the provided text.",
  "pioglitazone": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.\n\nSERIOUS SIDE EFFECTS: Heart failure (worsening of existing condition or new onset).  Symptoms may include large weight gain, shortness of breath, swelling in extremities, stomach swelling/pain, waking up short of breath, needing extra pillows to breathe easier, frequent dry cough/wheezing, confusion, rapid heartbeat, decreased exercise tolerance, and increased tiredness.\n\nRARE SIDE EFFECTS: The provided text does not list rare side effects.",
  "piperacillin": "COMMON SIDE EFFECTS: diarrhea, constipation, nausea, vomiting, heartburn, stomach pain, fever, headache, mouth sores, difficulty falling asleep or staying asleep.\n\nSERIOUS SIDE EFFECTS: rash, itching, hives, difficulty breathing or swallowing, wheezing, severe diarrhea (watery or bloody stools) that may occur with or without fever and stomach cramps (may occur up to 2 months or more after treatment).\n\nRARE SIDE EFFECTS:  The provided text does not specify rare side effects.",
  "pitavastatin": "COMMON SIDE EFFECTS: back pain, constipation, diarrhea, memory loss or forgetfulness, confusion\n\nSERIOUS SIDE EFFECTS: muscle pain, tenderness, or weakness; fever; nausea; extreme tiredness; unusual bleeding or bruising; lack of energy; loss of appetite; pain in the upper right part of the stomach; yellowing of the skin or eyes; dark urine; flu-like symptoms; rash; itching; hives\n\nRARE SIDE EFFECTS:  Not specified in the provided text.",
  "policosanol": "No side effects information found.",
  "pravastatin": "No side effects information found on this page.",
  "prednisone": "No side effects information found on this page.  While the page mentions potential consequences of suddenly stopping prednisone (extreme tiredness, weakness, etc.), these are not listed as side effects of the medication itself, but rather withdrawal symptoms.",
  "pregabalin": "No side effects information found on this page.  While the page mentions side effects as a section header, the content for that section is not included in the provided text.",
  "probucol": "No side effects information found.",
  "protriptyline": "COMMON SIDE EFFECTS:  The provided text does not list common side effects of protriptyline.\n\nSERIOUS SIDE EFFECTS: Suicidal thoughts or behavior (especially in children, teenagers, and young adults), new or worsening depression, extreme worry, agitation, panic attacks, sleep disturbances, aggressive behavior, irritability, acting without thinking, severe restlessness, and frenzied abnormal excitement.\n\nRARE SIDE EFFECTS: The provided text does not list rare side effects of protriptyline.",
  "psyllium": "COMMON SIDE EFFECTS:  Nausea, vomiting, itching, skin rash.\n\nSERIOUS SIDE EFFECTS: Difficulty breathing, stomach pain, difficulty swallowing.\n\nRARE SIDE EFFECTS:  Not specified on this page.",
  "quetiapine": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.\n\nSERIOUS SIDE EFFECTS: Increased risk of death in older adults with dementia; suicidal thoughts or actions (especially in children, teenagers, and young adults, and potentially at the start of treatment or when dosage changes).\n\nRARE SIDE EFFECTS: The provided text does not list rare side effects.",
  "ramipril": "COMMON SIDE EFFECTS: headache, dizziness, cough, upset stomach, vomiting, excessive tiredness, weakness\n\nSERIOUS SIDE EFFECTS: swelling of the face, throat, tongue, lips, eyes, hands, feet, ankles, or lower legs, hoarseness, difficulty breathing or swallowing, yellowing of the skin or eyes, fever, sore throat, chills, and other signs of infection, lightheadedness, fainting\n\nRARE SIDE EFFECTS:  Not specified in provided text.",
  "risperidone": "No side effects information found on this page.  While the page mentions potential interactions with other medications and warnings about potential serious consequences (increased risk of death in older adults with dementia), it does not provide a list of side effects the medication itself may cause.",
  "rituximab": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.  It focuses on serious and rare adverse reactions.\n\nSERIOUS SIDE EFFECTS:  Serious reactions (potentially fatal) can occur during or within 24 hours of infusion, especially the first dose. Symptoms include hives, rash, itching, swelling of lips/tongue/throat, difficulty breathing/swallowing, dizziness, fainting, shortness of breath/wheezing, headache, irregular heartbeat, fast/weak pulse, pale/bluish skin, chest pain (possibly radiating), weakness, heavy sweating. Severe, life-threatening skin and mouth reactions (painful sores/ulcers, blisters, rash, peeling skin) are also possible.  Reactivation of hepatitis B, leading to serious liver damage, is a risk. Progressive multifocal leukoencephalopathy (PML), a rare and often fatal brain infection, is another serious risk.\n\n\nRARE SIDE EFFECTS:  Progressive multifocal leukoencephalopathy (PML) is explicitly mentioned as a rare side effect.",
  "rivaroxaban": "No side effects information found on this page.  While the page mentions risks associated with the medication (e.g., increased stroke risk after stopping treatment, spinal blood clot risk with epidural anesthesia), it does not list specific side effects in a standard format.",
  "rivastigmine": "COMMON SIDE EFFECTS: nausea, vomiting, loss of appetite, heartburn or indigestion, stomach pain, weight loss, diarrhea, constipation, gas, weakness, dizziness, headache, extreme tiredness, lack of energy, tremor or worsening of tremor, increased sweating, difficulty falling asleep or staying asleep, confusion.\n\nSERIOUS SIDE EFFECTS: rash, hives, difficulty breathing or swallowing, black and tarry stools, red blood in stools, bloody vomit, vomiting material that looks like coffee grounds, difficulty urinating, painful urination, seizures, depression, anxiety, aggressive behavior, hearing voices or seeing things that do not exist, uncontrollable movements and muscle contractions.\n\nRARE SIDE EFFECTS:  Not explicitly specified in the provided text.",
  "roflumilast": "COMMON SIDE EFFECTS: diarrhea, nausea, dizziness, headache, back pain, muscle spasms, decreased appetite, uncontrollable shaking of a body part.\n\nSERIOUS SIDE EFFECTS:  The text mentions that some side effects can be serious, directing readers to the \"SPECIAL PRECAUTIONS\" section (which is not fully provided in this excerpt) for a list of these serious side effects.  No specific serious side effects are listed in the \"What side effects can this medication cause?\" section.\n\nRARE SIDE EFFECTS: No rare side effects are specifically mentioned.",
  "rosiglitazone": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.\n\nSERIOUS SIDE EFFECTS: Congestive heart failure (worsening of existing condition or new onset).  Symptoms may include: large weight gain, shortness of breath, swelling in extremities, stomach swelling/pain, waking up short of breath, needing extra pillows to breathe while lying down, frequent dry cough/wheezing, difficulty thinking/confusion, fast heartbeat, reduced ability to walk/exercise, increased tiredness.\n\nRARE SIDE EFFECTS: The provided text does not list rare side effects.",
  "rosuvastatin": "COMMON SIDE EFFECTS: constipation, stomach pain, dizziness, difficulty sleeping, depression, joint pain, headache, memory loss or forgetfulness, confusion\n\nSERIOUS SIDE EFFECTS: muscle pain, tenderness, or weakness (persisting after stopping medication), lack of energy, fever, dark/reddish urine or decreased urine, yellowing of skin or eyes, dark colored urine, upper right abdomen pain, nausea, extreme tiredness, unusual bleeding or bruising, loss of appetite, flu-like symptoms, rash, hives, itching, difficulty breathing or swallowing, swelling of face, throat, tongue, lips, eyes, hands, feet, ankles, or lower legs, hoarseness\n\nRARE SIDE EFFECTS:  Not specified in the provided text.",
  "salmeterol": "No side effects information found on this page.",
  "selegiline": "COMMON SIDE EFFECTS: dizziness, lightheadedness, fainting, dry mouth, nausea, vomiting, stomach pain, difficulty swallowing, heartburn, diarrhea, gas, constipation, difficulty falling asleep or staying asleep, unusual dreams, sleepiness, depression, pain (especially in legs or back), muscle pain or weakness, rash, redness, irritation, or sores in the mouth (with orally disintegrating tablets).\n\nSERIOUS SIDE EFFECTS: severe headache, chest pain, fast, irregular, or pounding heartbeat.  Sudden and dangerous increase in blood pressure (with overdose). Fever, sweating, stiff muscles, and loss of consciousness (upon sudden cessation of medication).\n\n\nRARE SIDE EFFECTS:  The provided text does not specify any side effects as rare.",
  "semaglutide": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.\n\nSERIOUS SIDE EFFECTS:  Semaglutide may increase the risk of thyroid tumors, including medullary thyroid carcinoma (MTC).  Pancreatitis is also mentioned as a condition to inform one's doctor about before taking the medication, implying it may be a serious side effect or contraindication.\n\nRARE SIDE EFFECTS: The provided text does not specify rare side effects.",
  "sertraline": "COMMON SIDE EFFECTS:  The provided text does not list common side effects of sertraline.  It focuses primarily on the serious risk of suicidality, especially in young adults.  Withdrawal symptoms upon cessation are mentioned (nausea, sweating, depression, mood changes,  irritability, anxiety, confusion, dizziness, headache, tiredness, seizures, ringing in the ears, numbness or tingling).\n\n\nSERIOUS SIDE EFFECTS: Suicidal thoughts or behavior (thinking about harming or killing oneself, or planning or trying to do so); new or worsening depression; extreme worry; agitation; panic attacks; new or worsening anxiety; difficulty sleeping; aggressive behavior; irritability; acting without thinking; severe restlessness; frenzied abnormal excitement.\n\n\nRARE SIDE EFFECTS: The provided text does not specify rare side effects.",
  "sevelamer": "COMMON SIDE EFFECTS: diarrhea, vomiting, nausea, stomach pain, gas, heartburn, new or worsening constipation\n\nSERIOUS SIDE EFFECTS: black and tarry stools, red blood in stools\n\nRARE SIDE EFFECTS:  Not specified on this page.",
  "simvastatin": "No side effects information found on this page.",
  "spironolactone": "The provided text does not list specific side effects of spironolactone.  While it mentions that spironolactone has caused tumors in laboratory animals, this is presented as a warning, not a list of side effects experienced by humans taking the medication.  Therefore:\n\nNo side effects information found on this page.",
  "sucralfate": "COMMON SIDE EFFECTS: Constipation\n\nSERIOUS SIDE EFFECTS: Hives, rash, itching, difficulty breathing or swallowing, swelling of the face, throat, tongue, or lips.\n\nRARE SIDE EFFECTS:  No specific rare side effects are listed, however, the text states to call a doctor if any unusual problems occur while taking the medication.",
  "sulfasalazine": "COMMON SIDE EFFECTS: yellow or orange discoloration of urine or skin, diarrhea, headache, loss of appetite, upset stomach, vomiting, stomach pain.\n\nSERIOUS SIDE EFFECTS: rash, hives, itching or peeling or blistering skin, swelling of the eyes, face, lips, tongue, mouth, or throat, difficulty breathing or swallowing, swollen glands, fever, sore throat, chills, cough, night sweats, and other signs of infection, pale skin, tiredness, or shortness of breath, joint or muscle aches, yellowing of the skin or eyes, pain in the right upper part of the stomach, difficult or painful urination or cloudy, discolored or blood urine, chest pain, new or worsening cough, tiredness, unusual bleeding or bruising, weakness, seizures.\n\nRARE SIDE EFFECTS:  Not explicitly listed, but implied by the instruction to report serious side effects to the FDA.",
  "tenecteplase": "COMMON SIDE EFFECTS: Bleeding\n\nSERIOUS SIDE EFFECTS: Itching, rash, hives; swelling of face, eyelids, lips, mouth, tongue, or throat; trouble breathing, throat or chest tightness, feeling faint; changes in heartbeat; vomiting blood, blood in urine or stool; severe headache, nausea, vomiting; change in consciousness or wakefulness; weakness or numbness in face, arm, or leg (usually on one side); loss of vision; seizures; skin or toes that are purple in color; changes in vision; decrease in amount of urine; chest pain, trouble breathing; nausea, vomiting, abdominal pain that goes around to your back.\n\nRARE SIDE EFFECTS:  Not specified.",
  "theophylline": "COMMON SIDE EFFECTS: upset stomach, stomach pain, diarrhea, headache, restlessness, difficulty sleeping, irritability\n\nSERIOUS SIDE EFFECTS: vomiting, increased or rapid heart rate, irregular heartbeat, seizures, rash\n\nRARE SIDE EFFECTS:  Not specified on this page.",
  "ticagrelor": "COMMON SIDE EFFECTS: Dizziness, nausea, diarrhea\n\nSERIOUS SIDE EFFECTS: Shortness of breath (at rest, after minimal exercise, or any physical activity), chest pain, fast/slow/pounding/irregular heartbeat, slowed or irregular breathing, swelling of face, throat, tongue, lips, and eyes,  serious or life-threatening bleeding (unexplained, severe, long-lasting, or uncontrollable bleeding; pink or brown urine; red or black, tarry stools; bloody vomit or vomit resembling coffee grounds; coughing up blood or blood clots).\n\nRARE SIDE EFFECTS:  Not specified in the provided text.",
  "tirzepatide": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.\n\nSERIOUS SIDE EFFECTS:  Increased risk of thyroid tumors (including thyroid cancer);  the text mentions this risk was observed in rats, and it is unknown if it applies to humans.  Patients with a family history of thyroid cancer or MEN 2 syndrome should not use this medication.  Symptoms to report immediately include neck lump/swelling, hoarseness, difficulty swallowing, or shortness of breath.\n\nRARE SIDE EFFECTS: The provided text does not list rare side effects.",
  "tizanidine": "COMMON SIDE EFFECTS: dizziness, drowsiness, unusual tiredness or weakness, nervousness, vomiting, dry mouth, constipation\n\nSERIOUS SIDE EFFECTS: nausea, extreme tiredness, lack of energy, loss of appetite, unusual bleeding or bruising, pain in the upper right part of the stomach, yellowing of the skin or eyes, flu-like symptoms, rash, hives, itching, swelling of the face, throat, tongue, lips, or eyes, shortness of breath, difficulty breathing or swallowing, seeing things or hearing voices that do not exist, slow heartbeat, changes in vision\n\nRARE SIDE EFFECTS:  Not specified in the provided text.",
  "tocilizumab": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.  It focuses heavily on serious side effects related to infection risk.\n\nSERIOUS SIDE EFFECTS:  Serious infections (bacterial, viral, fungal);  worsening of existing infections (including tuberculosis and hepatitis B); cytokine release syndrome (a severe and possibly life-threatening reaction).  Symptoms may include fever, chills, sweating, difficulty breathing, sore throat, cough, weight loss, diarrhea, stomach pain, blood in phlegm, extreme tiredness, muscle aches, warm/red/painful skin, skin/mouth sores, burning urination, frequent urination.\n\nRARE SIDE EFFECTS: The provided text does not specify rare side effects.",
  "tofacitinib": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.  It focuses primarily on serious potential side effects.\n\nSERIOUS SIDE EFFECTS:  Serious infections (including fungal, bacterial, or viral infections potentially fatal and requiring hospitalization); serious heart problems (heart attack, stroke); life-threatening blood clots in legs, arms, lungs, or arteries; lymphoma and other cancers (including lung and skin cancer);  excessive white blood cell production (in post-kidney transplant patients).\n\nRARE SIDE EFFECTS: The provided text does not specify rare side effects, but implies that the serious side effects listed above may occur with varying frequency.",
  "topiramate": "No side effects information found on this page.  While the page mentions side effects as a section, the content of that section is not included in the provided text.",
  "tramadol": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.  It focuses heavily on serious and life-threatening potential side effects.\n\nSERIOUS SIDE EFFECTS: Serious or life-threatening breathing problems (slowed breathing, long pauses between breaths, shortness of breath), especially within the first 72 hours of treatment or when the dose is increased.  Overdose and death are possible if extended-release tablets/capsules are crushed or chewed.  Life-threatening withdrawal symptoms in newborns whose mothers took tramadol regularly during pregnancy.  Addiction is also a serious risk with prolonged use.\n\nRARE SIDE EFFECTS: The provided text does not specify rare side effects.",
  "tranylcypromine": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.  It focuses primarily on the risk of suicidality, especially in young adults.\n\nSERIOUS SIDE EFFECTS: Suicidal thoughts or behavior (thinking about harming or killing oneself, or planning or trying to do so), new or worsening depression, extreme worry, agitation, panic attacks, difficulty sleeping, aggressive behavior, irritability, acting without thinking, severe restlessness, and frenzied abnormal excitement.\n\nRARE SIDE EFFECTS: The provided text does not specify rare side effects.",
  "trazodone": "COMMON SIDE EFFECTS: The provided text does not list common side effects of Trazodone.  It focuses heavily on the risk of suicidality, particularly in young adults.\n\nSERIOUS SIDE EFFECTS:  Suicidal thoughts or behavior (especially in children, teenagers, and young adults), new or worsening depression, extreme worry, agitation, panic attacks, sleep disturbances, aggressive behavior, irritability, acting without thinking, severe restlessness, frenzied abnormal excitement, seizures.  Withdrawal symptoms upon sudden cessation (dizziness, nausea, headache, confusion, anxiety, agitation, sleep disturbances, extreme tiredness, pain/burning/tingling in extremities, frenzied or abnormally excited mood, ringing in the ears, sweating) are also mentioned as serious potential consequences.\n\n\nRARE SIDE EFFECTS: The provided text does not specify rare side effects.",
  "trimipramine": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.\n\nSERIOUS SIDE EFFECTS: Suicidal thoughts or behavior (especially in children, teenagers, and young adults), new or worsening depression, extreme worry, agitation, panic attacks, sleep disturbances, aggressive behavior, irritability, acting without thinking, severe restlessness, and frenzied abnormal excitement.\n\nRARE SIDE EFFECTS: The provided text does not list rare side effects.",
  "umeclidinium": "COMMON SIDE EFFECTS: nervousness, shaking of a body part, runny nose, sore throat, taste changes, back pain.\n\nSERIOUS SIDE EFFECTS: hives, rash, swelling of face, throat, or tongue, pounding/fast/irregular heartbeat, chest pain, coughing/wheezing/chest tightness (beginning after inhalation), fatigue, weakness, nausea, vomiting, lack of energy, difficulty urinating, weak/dripping urine stream, frequent/painful urination.\n\nRARE SIDE EFFECTS:  No rare side effects are specifically listed.",
  "valsartan": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.\n\nSERIOUS SIDE EFFECTS:  The text mentions that taking valsartan and sacubitril during the last 6 months of pregnancy may cause death or serious injury to the fetus.  It also notes that dizziness, lightheadedness, and fainting can occur, particularly when first starting the medication, and that diarrhea, vomiting, dehydration, and excessive sweating can lead to a drop in blood pressure and fainting.\n\nRARE SIDE EFFECTS: The provided text does not specify rare side effects.",
  "vancomycin": "COMMON SIDE EFFECTS: nausea, vomiting, stomach pain, diarrhea, gas, headache, back pain\n\nSERIOUS SIDE EFFECTS: sore throat, fever, chills, other signs of infection, hives, rash, itching, sores or blisters in mouth or on tongue or lips, difficulty breathing or swallowing, redness of skin above waist, pain and muscle tightness of chest and back, ringing in the ears, decreased urination, swelling of face, arms, hands, feet, ankles, or lower legs, unusual tiredness or weakness\n\nRARE SIDE EFFECTS:  Not specified in the provided text.",
  "venlafaxine": "COMMON SIDE EFFECTS:  The provided text mentions withdrawal symptoms as a common occurrence upon discontinuation of venlafaxine. These include agitation, anxiety, tiredness, confusion, mood changes, headache, dizziness, irritability, frenzied or abnormal excitement, lack of coordination, sleep disturbances (trouble falling asleep or staying asleep, nightmares), nausea, vomiting, loss of appetite, diarrhea, dry mouth, sweating, uncontrollable shaking, ringing in the ears, blurred vision, seizures, and burning/tingling/numbness/electric shock-like sensations.\n\nSERIOUS SIDE EFFECTS:  Suicidal thoughts or behavior are listed as a serious side effect, particularly in children, teenagers, and young adults.  New or worsening depression, extreme worry, agitation, panic attacks, aggressive behavior, acting without thinking, severe restlessness, and frenzied abnormal excitement are also mentioned as symptoms requiring immediate medical attention.\n\nRARE SIDE EFFECTS: The provided text does not specify any side effects as rare.",
  "verapamil": "COMMON SIDE EFFECTS: constipation, heartburn, dizziness or lightheadedness, headache\n\nSERIOUS SIDE EFFECTS: swelling of the hands, feet, ankles, or lower legs; difficulty breathing or swallowing; slow heartbeat; fainting; blurred vision; rash; nausea; extreme tiredness; unusual bleeding or bruising; lack of energy; loss of appetite; pain in the upper right part of the stomach; yellowing of the skin or eyes; flu-like symptoms; fever\n\nRARE SIDE EFFECTS:  Not specified in the provided text.",
  "vilanterol": "COMMON SIDE EFFECTS: nervousness, shaking of a body part, runny nose or sore throat, taste changes, back pain.\n\nSERIOUS SIDE EFFECTS: hives, rash, swelling of face, throat, or tongue, pounding/fast/irregular heartbeat, chest pain, coughing/wheezing/chest tightness beginning after inhalation, fatigue, weakness, nausea, vomiting, lack of energy, difficulty urinating, weak urine stream, frequent/painful urination.\n\nRARE SIDE EFFECTS:  No rare side effects are specifically mentioned.",
  "vilazodone": "COMMON SIDE EFFECTS: The provided text does not list common side effects, but mentions withdrawal symptoms upon cessation of the drug including dizziness, nausea, headache, confusion, irritability, agitation, sleep disturbances, anxiety, extreme tiredness, seizures, pain/burning/tingling in extremities, frenzied or abnormally excited mood, and sweating.\n\nSERIOUS SIDE EFFECTS: Suicidal thoughts or behavior, especially in children, teenagers, and young adults (up to 24 years of age),  new or worsening depression, extreme worry, agitation, panic attacks, aggressive behavior, acting without thinking, severe restlessness, frenzied abnormal excitement, and other changes in thoughts, mood, or behavior are mentioned as serious side effects requiring immediate medical attention.\n\nRARE SIDE EFFECTS:  The provided text does not specify rare side effects.",
  "vortioxetine": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.  Withdrawal symptoms upon cessation are described as headache, mood changes, irritability, agitation, nausea, dizziness, burning, numbness, or tingling in the hands or feet, anxiety, confusion, sweating, shaking, frenzied or abnormally excited mood, ringing in the ears, tiredness, difficulty falling asleep or staying asleep, and seizures.\n\nSERIOUS SIDE EFFECTS: Suicidal thoughts or behavior (especially in young adults up to 24 years of age), new or worsening depression, extreme worry, agitation, panic attacks, difficulty sleeping, aggressive behavior, irritability, acting without thinking, severe restlessness, and frenzied abnormal excitement.\n\nRARE SIDE EFFECTS: The provided text does not specify rare side effects.",
  "warfarin": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.  It focuses on the risk of severe bleeding.\n\nSERIOUS SIDE EFFECTS: Severe bleeding (life-threatening, potentially fatal).  Symptoms include pain, swelling, discomfort, bleeding that doesn't stop, nosebleeds, bleeding gums, coughing or vomiting blood, unusual bleeding or bruising, increased menstrual flow or vaginal bleeding, pink/red/dark brown urine, red or tarry black stools, headache, dizziness, or weakness.\n\nRARE SIDE EFFECTS:  The provided text does not specify rare side effects.",
  "zanamivir": "COMMON SIDE EFFECTS:  The provided text does not list common side effects.\n\nSERIOUS SIDE EFFECTS: Serious or life-threatening breathing problems (wheezing, shortness of breath), especially in patients with asthma or emphysema.  Confusion, agitation, anxiety, strange behavior, seizures, hallucinations, self-harm, or suicide (especially in children and teenagers with the flu).\n\nRARE SIDE EFFECTS: The provided text does not list rare side effects.",
  "ziprasidone": "No side effects information found on this page.  While the page mentions several precautions and warnings related to potential problems *associated with* taking ziprasidone (e.g., increased risk of death in older adults with dementia, hyperglycemia,  problems in newborns if taken late in pregnancy), it does not explicitly list side effects in a standard format.",
  "📈 DATA QUALITY SUMMARY": "No side effects information found.",
  "Brand Names": "COMMON SIDE EFFECTS: irregular vaginal bleeding or spotting, changes in menstrual flow, enlarged or tender breasts, nausea, vomiting, bloating, weight changes, difficulty falling asleep or staying asleep, acne, brown patches on the face, hair loss, growth of hair on the face.\n\nSERIOUS SIDE EFFECTS: loss of vision, blurred vision, double vision, bulging eyes, migraine headache, pain, warmth, or heaviness in the back of the lower legs, shortness of breath, coughing up blood, sudden sharp or crushing chest pain, heaviness in chest, slow or difficult speech, dizziness or faintness, weakness or numbness of an arm or leg, swelling of the arms, hands, feet, ankles, or lower legs, yellowing of the skin or eyes, depression, mood swings, missed periods, sudden, severe pain in the abdomen.\n\nRARE SIDE EFFECTS:  The provided text does not specify which side effects are rare, only that some are uncommon and warrant immediate medical attention.",
  "Dosage Forms": "No side effects information found on this page.  While the page mentions side effects as a section heading, the content of that section is not included in the provided text.",
  "How to Take": "No side effects information found.",
  "When to Take": "No side effects information found.",
  "Overall Quality": "No side effects information found."
}